{
  "Add a todo": "Agregar lista de quehaceres ",
  "Submit": "Enviar",
  "Todo title": "Título de quehaceres",
  "A todos title should be a good summarization of what the todo needs in order to be complete": "El título de un quehacere deberia ser un summario bueno de las cosas que necesitan hacer a completir el quehacere.El título de un quehacere deberia ser un sumario bueno de las cosas que necesitan hacer a completir el quehacere",
  "Todo title...": "Título de quehaceres...",
  "Todo description": "Descripción del quehacere",
  "Any details necessary to complete the todo should go here": "Cualquier detalles que son necesarios a completar el quehacer deberia ir aqui",
  "Any details that are needed to complete the todo": "Cualquier detalles que son necesarios a completar el quehacer.",
  "Todos": "Quehaceres",
  "Add todo": "Enviar quehaceres",
  "Home": "Inicio",
  "About": "Detalles", 
  "Releases": "Lanzamientos",
  "Login": "Login",
  "Logout": "Cerrar sesión",
  "Posted at": "Publicado a {{date}}",
  "About this project": "Detalles de este proyecto",
  "About-description": "Este proyecto es sobre veyendo más que el arcquitectura. This project is about showing more about the <1>architecture</1> of a larger app than it is about what the app <3>does</3>. For newer people it often is about how cool what they are working on is. This works well, except for in trying to dive into what they perceive as cool they miss a lot of the more minor steps.",
  "Release-description": "Note: the text below is from an API and therefore will always be in English.",
  "About-Author-Description": "Before we go any further, let me introduce myself. My name is Jim Burbridge and I've been working in the web since I was 12. I did freelance throughout middle and high school, have interviewed with multiple FAANG companies (and currently work at one). I am currently a Front-End Engineer by title, but I will do work anywhere that is interesting.",
  "About-Out-of-it": "So, what do <1>we</1> get out of it?",
  "About-see-an-application": "We see an application with quite a few components, unit tests, and e2e tests. As well, we get to see how to integrate with things like the AWS CDK, which builds our staging and production URLs; and AWS Cognito, which is how we handle our user login system.",
  "About-stack": "So, what's the stack?",
  "About-stack-description": "Glad you asked! Unfortunately there isn't a simple solid answer I can give you. Applications tend to be more complex than people think. The components responsible for the build are:",
  "Front-End": "Front-End",
  "Back-End": "Back-End",
  "Done?": "Hecho?",
  "Title": "Título",
  "Description": "Descripción",
  "Actions": "Actividades",
  "Todos-empty": "No hay algunos quehaceres. Pon clic en el icono de pluma a adeñar uno"
}