{
  "Add a todo": "Agregar lista de quehaceres ",
  "Submit": "Enviar",
  "Todo title": "Título de quehaceres",
  "A todos title should be a good summarization of what the todo needs in order to be complete": "El título de un quehacere deberia ser un summario bueno de las cosas que necesitan hacer a completir el quehacere.El título de un quehacere deberia ser un sumario bueno de las cosas que necesitan hacer a completir el quehacere",
  "Todo title...": "Título de quehaceres...",
  "Todo description": "Descripción del quehacere",
  "Any details necessary to complete the todo should go here": "Cualquier detalles que son necesarios a completar el quehacer deberia ir aqui",
  "Any details that are needed to complete the todo": "Cualquier detalles que son necesarios a completar el quehacer.",
  "Todos": "Quehaceres",
  "Add todo": "Enviar quehaceres",
  "Home": "Inicio",
  "Releases": "Lanzamientos",
  "Login": "Login",
  "Logout": "Cerrar sesión",
  "Posted at": "Publicado a {{date}}",
  "Release-description": "Note: the text below is from an API and therefore will always be in English.",
  "Front-End": "Front-End",
  "Back-End": "Back-End",
  "Done?": "Hecho?",
  "Title": "Título",
  "Description": "Descripción",
  "Actions": "Actividades",
  "Todos-empty": "No hay algunos quehaceres. Pon clic en el icono de pluma a adeñar uno",
  "work in progress": "trabajo en progresso",
  "Username": "Nombre del usario",
  "Username-description": "Noota: eo NO ES su nombre del usario preferado o su Email",
  "Username-placeholder": "bob_rocks89, or demonslayer77",
  "Password": "Contraseña",
  "Password-description": "No comparte su contraseña con alguien, ok?",
  "Password-placeholder": "(8+)Mayúsculas, miúsculas, carácter especial.",
  "Clear-form": "Está seguro de que deseas borrar el formulario?",
  "Login-form": "Formulario de inicio de sesión",
  "Signup": "Inscribirse",
  "Reset": "Reiniciar",
  "Signup-page": {
    "title": "Inscribirse",
    "Confirm-username": "Confirma el nobre del usuario",
    "Desired-username": "Nombre de usuario deseado",
    "Email": "Email",
    "Email-description": "Su dirección de correo electrónico, por ejemplo bob@company.com",
    "Confirm-password": "Confirma contraseña",
    "Confirm-password-description": "Confirma su contraseña",
    "Password-description": "Ingresa tu contraseña",
    "Preferred-username": "Nombre de usuario preferido",
    "Preferred-username-placeholder": "Ingresa tu nombre de usuario preferido",
    "Preferred-username-description": "Esto se va a ser el nombre de usuario que vees en el sitio.",
    "Verification-code": "Código de verificación",
    "Verify": "Verifica"
  },
  "About": {
    "About-stack": "Pués, qué es el stack?",
    "About-stack-description": "Me alegro de que lo hayas preguntado! Desfortunademente, no hay una respuesta simple y sólida que pueda darte. Las aplicaciones tienden a ser más complejas de lo que la gente piensa. Los componentes responsables de la construcción son:",
    "About-see-an-application": "Vemos un applicación con muchos componentes, pruebas de unidad, y prueba de extremo a extremo. También llegamos a ver comó integrar con cosas como the AWS CDK, que construye nuestro URLs para \"staging\" y \"production\"; también con AWS Cognito, cual es como manejamos a nuestras usuarios.",
    "About-Out-of-it": "Entonces, qué <1>sacamos</1> de eso?",
    "About-this-project": "Detalles de este proyecto",
    "About-description": "Este proyecto es sobre veyendo más el arcquitectura del proyecto mas que qué el proyecto hace. This project is about showing more about the <1>architecture</1> of a larger app than it is about what the app <3>does</3>. Para personas nuevas a programmar es a menudo sobre como interesantes son las cosas que estan trabajando en. Esté funciona bien, excepto al tratar de sumergirse en lo que perciben como genial, se pierden muchos más pasos menores.",
    "navbar": "Detalles",
    "The-Author": "El Autor",
    "About-Author-Description": "Antes que continuar, pertítame presentarme. Me llamo Jim y he estado trabajando con el web durante muchos años. Hizo freelance durante escuela secundaria, y me he entrevistado con muchos de los companias de FAANG. Actualmente soy un Front-End Engineer, pero trabajo en cualquier lugar que tiene mi interessa",
    "vidi-ui-disclaimer": "Vidi UI es un parte del mismó proyecto, pero está seperada en su propio repo.",
    "thats-it": "Es todó?",
    "yes-but-no": "Sí, pero no en realidad!",
    "tools": "Esos son solo los herramientas que uso a desarrollar el anverso y el reverso. Comenzaremos enumerando todos los paquetes involucrados en la realización de este proyecto.",
    "about-front-end": "Esté es actualmente el proyecto que estas viendo ahora. Lo maneja las páginas, y su CDK incluye lo que necesita para CloudFront y S3 a implementar el código.",
    "about-back-end": "Esté es el repositorio principal para el API. Crea un API Gateway, ademas a algunas funciones de Lambda para basica <1>CRUD</1> functionalidad.",
    "about-share-infrastructure": "Los dos del FE y BE necesitan Cognito, así que la infrastructura que crealo se necesitan ser seperarse de los dos del FE y del BE. He hecho más o menos porque el FE necesitan informacion del BE, y el BE necesitan informacion sobre Cognito para authorizar solicitudes. Esté significa que poniendo el informacion de Cognito en el FE se requiraban una person Esto significaba que poner la información de Cognito en la FE requeriría que alguien construyera e implementara el front-end, luego construyera e implementara el back-end, y luego reconstruyera y reinstalara el front-end. Separarlo significa que no tenemos que realizar ese flujo.",
    "about-viddi": "A un punto durante desarrollo hay <1>muchos</1> de los componentes para el FE en el repo. Estes componentes se movierón al entro \"Viddi UI\". El Viddi UI automate alugnas partes del processo que son necesario cuando trabajas con componentes de UI, por ejemplo generacion de un CHANGELOG. Publicando automatico a NPM es <3>TIP</3>",
    "does-for-you": "Qué espero que esto haga por ti?",
    "best-case-scenario": "Espero que esté proyecto dale personas una ventana alentro que necesitan a hacer un aplicación simple. Lo usa muchos coasas, por ejemplo Infraestructura-como-código, funciones sin servidor, y un implementación de JAMstack aproximada"
  }
}